[
    {
        "title": "Spaghetti Carbonara",
        "ingredients": "Espaguetis, Huevos, Panceta, Queso parmesano, Ajo, Sal, Pimienta",
        "procedure": [
            "Cocer los espaguetis en agua con sal.",
            "Freír la panceta en una sartén hasta que esté crujiente.",
            "Batir los huevos con el queso parmesano rallado.",
            "Mezclar los espaguetis con la panceta y añadir la mezcla de huevos y queso.",
            "Sazonar con sal y pimienta al gusto."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/sc1.jpg","/home/dani/Documentos/CocinApp/iniciarBD/img/sc2.jpg"],        
        "time": "20-40min",
        "difficulty": "medium",
        "type": "main dishes"
    },
    {
        "title": "Tacos de Pollo",
        "ingredients": "Pechuga de pollo, Tortillas, Lechuga, Tomate, Cebolla, Salsa de yogurt, Limón",
        "procedure": [
            "Cocinar la pechuga de pollo en una sartén con aceite hasta que esté dorada.",
            "Picar la lechuga, el tomate y la cebolla.",
            "Rellenar las tortillas con el pollo y los ingredientes frescos.",
            "Añadir salsa de yogurt y un toque de limón."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/tp1.jpg","/home/dani/Documentos/CocinApp/iniciarBD/img/tp2.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "main dishes"
    },

    {
        "title": "Paella Valenciana",
        "ingredients": "Arroz, Mariscos, Pollo, Conejo, Judía verde, Pimiento, Tomate, Caldo de pescado, Aceite de oliva, Azafrán",
        "procedure": [
            "Freír el pollo y conejo en una paellera con aceite de oliva.",
            "Agregar los mariscos y cocinar a fuego medio.",
            "Añadir el arroz, el caldo de pescado y el azafrán.",
            "Cocinar a fuego lento hasta que el arroz esté tierno y el líquido se haya absorbido."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/paella.jpg"],        
        "time": "40-90min",
        "difficulty": "medium",
        "type": "main dishes"
    },
    {
        "title": "Sushi Roll",
        "ingredients": "Arroz para sushi, Alga nori, Pescado crudo, Aguacate, Pepino, Salsa de soja, Wasabi",
        "procedure": [
            "Cocer el arroz para sushi siguiendo las instrucciones del paquete.",
            "Extender una capa delgada de arroz sobre el alga nori.",
            "Colocar los ingredientes como el pescado crudo, aguacate y pepino en el centro.",
            "Enrollar el sushi con ayuda de una esterilla de bambú.",
            "Cortar en porciones y servir con salsa de soja y wasabi."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/sushi1.jpg"],        
        "time": "40-90min",
        "difficulty": "hard",
        "type": "main dishes"
    },
    {
        "title": "Hamburguesa Vegana",
        "ingredients": "Hamburguesas veganas, Pan de hamburguesa, Lechuga, Tomate, Cebolla, Ketchup, Mostaza",
        "procedure": [
            "Cocinar las hamburguesas veganas en una sartén hasta que estén doradas.",
            "Preparar los ingredientes frescos: cortar la lechuga, el tomate y la cebolla.",
            "Montar la hamburguesa colocando las hamburguesas en el pan y añadiendo los ingredientes frescos.",
            "Servir con ketchup y mostaza al gusto."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/hv.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "main dishes"
    },
    {
        "title": "Lasagna de Carne",
        "ingredients": "Carne molida, Láminas de lasaña, Salsa bechamel, Salsa de tomate, Queso rallado, Cebolla, Ajo, Aceite de oliva, Sal",
        "procedure": [
            "Cocer las láminas de lasaña en agua con sal.",
            "Freír la carne molida con cebolla y ajo en una sartén.",
            "Montar la lasaña alternando capas de láminas, salsa bechamel, salsa de tomate y carne.",
            "Hornear la lasaña hasta que el queso se derrita y se dore."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/l1.jpg"],        
        "time": "40-90min",
        "difficulty": "medium",
        "type": "main dishes"
    },
    {
        "title": "Ensalada Griega",
        "ingredients": "Pepino, Tomate, Aceitunas, Queso feta, Aceite de oliva, Limón, Orégano, Sal",
        "procedure": [
            "Picar los pepinos, tomates y queso feta en trozos pequeños.",
            "Mezclar los ingredientes en un bol.",
            "Añadir aceitunas y aderezar con aceite de oliva, limón, orégano y sal.",
            "Servir fría como acompañamiento o plato principal."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/eg.jpg"],        
        "time": "<20min",
        "difficulty": "easy",
        "type": "salads"
    },
    {
        "title": "Pollo al Curry",
        "ingredients": "Pechuga de pollo, Leche de coco, Curry en polvo, Cebolla, Ajo, Aceite de oliva, Sal, Pimienta, Arroz",
        "procedure": [
            "Cocinar el pollo con cebolla y ajo en una sartén con aceite de oliva.",
            "Añadir el curry en polvo y mezclar bien.",
            "Agregar la leche de coco y cocinar hasta que la salsa espese.",
            "Servir con arroz blanco cocido."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/pc1.jpg"],        
        "time": "20-40min",
        "difficulty": "medium",
        "type": "main dishes"
    },
    {
        "title": "Tarta de Manzana",
        "ingredients": "Manzanas, Masa quebrada, Azúcar, Canela, Mantequilla, Limón",
        "procedure": [
            "Pelar y cortar las manzanas en láminas finas.",
            "Mezclar las manzanas con azúcar, canela y un toque de limón.",
            "Colocar las manzanas sobre la masa quebrada y añadir trozos de mantequilla por encima.",
            "Hornear hasta que la masa esté dorada y las manzanas tiernas."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/tm1.jpg"],        
        "time": "40-90min",
        "difficulty": "medium",
        "type": "desserts"
    },
    {
        "title": "Lentejas",
        "ingredients": "Lentejas, Zanahoria, Cebolla, Ajo, Caldo de verduras, Aceite de oliva, Sal, Pimienta",
        "procedure": [
            "Cocer las lentejas en el caldo de verduras hasta que estén tiernas.",
            "Añadir las zanahorias, cebolla y ajo picados.",
            "Cocinar a fuego lento hasta que los ingredientes estén bien cocidos.",
            "Sazonar con sal y pimienta al gusto."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/lentejas.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "soups"
    },
    {
        "title": "Raviolis Caseros",
        "ingredients": "Harina, Huevos, Ricotta, Espinacas, Salsa de tomate, Queso parmesano",
        "procedure": [
            "Preparar la masa de ravioli con harina y huevos, amasar hasta obtener una textura suave.",
            "Mezclar ricotta con espinacas cocidas y sazonar.",
            "Formar los raviolis con la masa y rellenarlos con la mezcla de ricotta.",
            "Cocer los raviolis en agua hirviendo hasta que floten.",
            "Servir con salsa de tomate y queso parmesano rallado."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/ra.jpg"],        
        "time": "40-90min",
        "difficulty": "expert",
        "type": "main dishes"
    },
    {
        "title": "Batido de Fresa",
        "ingredients": "Fresas, Leche, Azúcar, Hielo, Yogur natural",
        "procedure": [
            "Lavar bien las fresas y quitarles las hojas.",
            "Colocar las fresas en una licuadora junto con la leche, el azúcar, el hielo y el yogur natural.",
            "Licuar todo hasta obtener una mezcla suave y cremosa.",
            "Servir frío y disfrutar."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/batidofresa.jpg"],        
        "time": "<20min",
        "difficulty": "easy",
        "type": "drinks"
    },
    {
        "title": "Guisado de Garbanzos",
        "ingredients": "Garbanzos, Tomate, Cebolla, Ajo, Zanahoria, Pimiento, Caldo de verduras, Aceite de oliva, Sal, Pimienta",
        "procedure": [
            "Remojar los garbanzos durante toda la noche.",
            "Cocer los garbanzos en agua con sal hasta que estén tiernos.",
            "Freír la cebolla, ajo, zanahoria y pimiento en aceite de oliva.",
            "Añadir el tomate picado y cocinar hasta que el tomate se deshaga.",
            "Agregar los garbanzos cocidos, el caldo de verduras y sazonar al gusto.",
            "Cocinar a fuego lento durante 20 minutos y servir caliente."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/guisado_garbanzos.jpg"],        
        "time": "40-90min",
        "difficulty": "medium",
        "type": "soups"
    },
    {
        "title": "Ponche para Fiestas",
        "ingredients": "Zumo de naranja, Zumo de piña, Ron blanco, Azúcar, Hielo, Rodajas de naranja, Limón, Fresas",
        "procedure": [
            "Mezclar el zumo de naranja y piña en una jarra grande.",
            "Añadir el ron blanco y el azúcar al gusto, y remover bien.",
            "Agregar hielo y rodajas de naranja, limón y fresas.",
            "Dejar reposar en la nevera durante 30 minutos para que se enfríe.",
            "Servir en copas decoradas con más frutas."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/ponche_fiestas.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "drinks"
    },
    {
        "title": "Natillas",
        "ingredients": "Leche, Azúcar, Yemas de huevo, Maicena, Canela en rama, Piel de limón",
        "procedure": [
            "Calentar la leche con la canela y la piel de limón en una cacerola.",
            "Batir las yemas con el azúcar y la maicena.",
            "Cuando la leche esté caliente, añadir poco a poco sobre la mezcla de huevos y azúcar.",
            "Volver a poner la mezcla en la cacerola y cocinar a fuego medio, removiendo constantemente hasta que espese.",
            "Verter en cuencos, dejar enfriar y decorar con canela."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/natillas.jpg"],        
        "time": "40-90min",
        "difficulty": "medium",
        "type": "desserts"
    },
    {
        "title": "Fingers de Pollo",
        "ingredients": "Pechuga de pollo, Pan rallado, Harina, Huevos, Sal, Pimienta, Aceite para freír",
        "procedure": [
            "Cortar la pechuga de pollo en tiras delgadas.",
            "Sazonar el pollo con sal y pimienta.",
            "Pasar las tiras de pollo por harina, luego por huevo batido y finalmente por pan rallado.",
            "Freír en aceite caliente hasta que estén doradas y crujientes.",
            "Servir con salsa de tu elección."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/fingers_pollo.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "appetizers"
    },
    {
        "title": "Ensalada César",
        "ingredients": "Lechuga romana, Pollo a la parrilla, Crutones, Queso parmesano, Aderezo César",
        "procedure": [
            "Lavar y cortar la lechuga romana en trozos pequeños.",
            "Cocinar el pollo a la parrilla y cortarlo en tiras.",
            "Colocar la lechuga en un bol, agregar los crutones y el queso parmesano rallado.",
            "Añadir el pollo a la parrilla y mezclar todo con el aderezo César.",
            "Servir inmediatamente."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/ensalada_cesar.jpeg"],        
        "time": "<20min",
        "difficulty": "easy",
        "type": "salads"
    },
    {
        "title": "Nachos con Queso",
        "ingredients": "Tortillas de maíz, Queso cheddar rallado, Jalapeños, Salsa de tomate, Crema agria",
        "procedure": [
            "Colocar las tortillas de maíz en una bandeja para hornear.",
            "Espolvorear generosamente con queso cheddar rallado.",
            "Añadir jalapeños al gusto.",
            "Hornear a 180°C durante 10 minutos o hasta que el queso se derrita y las tortillas se vuelvan crujientes.",
            "Servir con salsa de tomate y crema agria."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/nachos_queso.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "snacks"
    },
    {
        "title": "Palitos de Mozzarella Empanados",
        "ingredients": "Queso mozzarella, Pan rallado, Harina, Huevos, Aceite para freír, Sal, Pimienta",
        "procedure": [
            "Cortar los palitos de mozzarella en tiras.",
            "Pasar los palitos de queso por harina, luego por huevo batido y finalmente por pan rallado.",
            "Freír en aceite caliente hasta que estén dorados y crujientes.",
            "Servir con salsa marinara o tu salsa favorita."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/palitos_mozzarella.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "snacks"
    },
    {
        "title": "Ropa Vieja (Estilo Cubano)",
        "ingredients": "Carne de res, Cebolla, Pimiento verde, Pimiento rojo, Ajo, Tomate, Caldo de carne, Comino, Orégano, Aceite de oliva, Aceitunas verdes, Pasas, Sal, Pimienta",
        "procedure": [
            "Cocer la carne de res en agua con sal durante 2-3 horas hasta que esté bien tierna.",
            "Sacar la carne, desmenuzarla y reservar.",
            "En una sartén grande, calentar el aceite de oliva y sofreír la cebolla, los pimientos y el ajo hasta que estén blandos.",
            "Añadir los tomates picados, el caldo de carne, el comino, el orégano, sal y pimienta, y cocinar a fuego lento durante unos 20 minutos.",
            "Agregar la carne desmenuzada a la sartén, junto con las aceitunas y las pasas, y cocinar a fuego lento por 30-40 minutos.",
            "Servir con arroz blanco y disfrutar."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/ropa_vieja1.jpg","/home/dani/Documentos/CocinApp/iniciarBD/img/ropa_vieja2.jpg"],        
        "time": ">90min",
        "difficulty": "medium",
        "type": "main dishes"
    },
    {
        "title": "Pizza Margherita",
        "ingredients": "Masa de pizza, Salsa de tomate, Mozzarella, Albahaca fresca, Aceite de oliva, Sal",
        "procedure": [
            "Precalentar el horno a 220°C.",
            "Extender la masa de pizza sobre una bandeja para hornear.",
            "Esparcir una capa de salsa de tomate sobre la masa.",
            "Agregar la mozzarella desmenuzada sobre la salsa.",
            "Hornear durante 10-12 minutos o hasta que la masa esté dorada y el queso derretido.",
            "Sacar del horno y agregar hojas de albahaca fresca.",
            "Rociar con un poco de aceite de oliva y sazonar con sal al gusto."
        ],
        "images": ["/home/dani/Documentos/CocinApp/iniciarBD/img/pizza_margherita.jpg"],        
        "time": "20-40min",
        "difficulty": "easy",
        "type": "main dishes"
    }    
]
